print(" Вам пропонується кілька питань. На кожне питання відповідайте лише «так» "
"або «ні». Не витрачайте час на обговорення питань, тут не може бути гарних або поганих "
"відповідей, тому що це не випробування розумових здібностей ")
a0= input("Ви зрозуміли? ")
while a0 == "ні":
		print(" Вам пропонується кілька питань. На кожне питання відповідайте лише /«так/»"
			  "або /«ні/». Не витрачайте час на обговорення питань, тут не може бути гарних або поганих"
			  "відповідей, тому що це не випробування розумових здібностей")
		a0 = input("Ви зрозуміли? ")
print("1.Вам подобається гамір, жвавість, енергійність у Вашому оточенні?")
a1 = input("")

if a1 == "так":
	a1 =int(1)
if a1 == "ні":
	a1 = int(0)

print("2.Вам потрібні друзі, які змогли б підтримати Вас?")
a2 = input("")

if a2 == "так":
	a2 = int(0)
if a2 == "ні":
	a2 = int(1)

print("3.Ви завжди швидко відповідаєте, коли Вас запитують?")
a3 = input("")

if a3 == "так":
	a3 = int(1)
if a3 == "ні":
	a3 = int(0)

print("4. Буває так, що Ви роздратовані чимось?")
a4 = input("")

if a4 == "так":
	a4 = int(0)
if a4 == "ні":
	a4 = int(1)

print("5. У Вас часто змінюється настрій?")
a5 = input("")

if a5 == "так":
	a5 = int(0)
if a5 == "ні":
	a5 = int(1)

print("6. Це правда, що Вам легко і приємніше із книжками, ніж із людьми?")
a6 = input("")

if a6 == "так":
	a6 = int(0)
if a6 == "ні":
	a6 = int(1)

print("7. У Вас буває таке, що різні думки заважають заснути?")
a7 = input("")

if a7 == "так":
	a7 = int(0)
if a7 == "ні":
	a7 = int(1)

print("8. Ви завжди робите так, як Вам говорять?")
a8 = input("")

if a8 == "так":
	a8 = int(1)
if a8 == "ні":
	a8 = int(0)

print("9. Вам подобається, коли хтось ніяковіє від Ваших гострих слів у його адресу?")
a9 = input("")

if a9 == "так":
	a9 = int(1)
if a9 == "ні":
	a9 = 0

print("10. Ви коли-небудь відчували себе нещасливими, хоча для цього не було причини?")
a10 = int(input(""))

if a10 == "так":
	a10 = 0
if a10 == "ні":
	a10 = 1

print("11. Ви можете сказати про себе, що Ви весела, жвава людина?")
a11 = int(input(""))

if a11 == "так":
	a11 = 1
if a11 == "ні":
	a11 = 0

print("12. Ви порушували встановлені правила поведінки?")
a12 = int(input(""))

if a12 == "так":
	a12 = 0
if a12 == "ні":
	a12 = 1

print("13. Це правда, що ви буваєте часто роздратовані?")
a13 = int(input(""))

if a13 == "так":
	a13 = 0
if a13 == "ні":
	a13 = 1

print("14. Вам подобається все робити швидко?")
a14 = int(input(""))

if a14 == "так":
	a14 = 1
if a14 == "ні":
	a14 = 0

print("15. Ви дуже переживаєте про неприємні події, які ледве не сталися з Вами, хоча все скінчилось добре?")
a15 = int(input(""))

if a15 == "так":
	a15 = 0
if a15 == "ні":
	a15 = 1

print("16. Вам можна довірити таємницю?")
a16 = int(input(""))

if a16 == "так":
	a16 = 1
if a16 == "ні":
	a16 = 0

print("17. Ви можете без зайвих зусиль внести пожвавлення в невеселе товариство?")
a17 = int(input(""))

if a17 == "так":
	a17 = 1
if a17 == "ні":
	a17 = 0

print("18. У Вас бувають випадки, коли Ваше серце б'ється дуже швидко?")
a18 = int(input(""))

if a18 == "так":
	a18 = 0
if a18 == "ні":
	a18 = 1

print("19. У більшості випадків Ви робите перший крок, щоб потоваришувати з ким-небудь?")
a19 = int(input(""))

if a19 == "так":
	a19 = 1
if a19 == "ні":
	a19 = 0

print("20. Ви говорили коли-небудь неправду?")
a20 = int(input(""))

if a20 == "так":
	a20 = 0
if a20 == "ні":
	a20 = 1

print("21. Ви дуже переживаєте, коли Вас критикують?")
a21 = int(input(""))

if a21 == "так":
	a21 = 0
if a21 == "ні":
	a21 = 1

print("22. У Вас гарне почуття гумору і Ви часто розповідаєте веселі історії своїм друзям?")
a22 = int(input(""))

if a22 == "так":
	a22 = 1
if a22 == "ні":
	a22 = 0


print("23. Ви часто почуваєте себе стомленим?")
a23 = int(input(""))

if a23 == "так":
	a23 = 0
if a23 == "ні":
	a23 = 1

print("24. Ви завжди спочатку виконуєте тяжче завдання, а потім інші?")
a24 = int(input(""))

if a24 == "так":
	a24 = 1
if a24 == "ні":
	a24 = 0

print("25. У більшості випадків Ви веселі й задоволені всім?")
a25 = int(input(""))

if a25 == "так":
	a25 = 1
if a25 == "ні":
	a25 = 0

print("26. Вас легко образити?")
a26 = int(input(""))

if a26 == "так":
	a26 = 0
if a26 == "ні":
	a26 = 1

print("27. Вам подобається спілкуватися з людьми?")
a27 = int(input(""))

if a27 == "так":
	a27 = 1
if a27 == "ні":
	a27 = 0

print("28. Ви завжди допомагаєте іншим, коли Вас просять про це?")
a28 = int(input(""))

if a28 == "так":
	a28 = 1
if a28 == "ні":
	a28 = 0

print("29. У Вас бувають запаморочення голови?")
a29 = int(input(""))

if a29 == "так":
	a29 = 0
if a29 == "ні":
	a29 = 1

print("30. Бувають випадки, коли Ваші дії ставлять у незручне становище інших?")
a30 = int(input(""))

if a30 == "так":
	a30 = 1
if a30 == "ні":
	a30 = 0

print("31. Ви часто відчуваєте, що Вам все набридло?")
a31 = int(input(""))

if a31 == "так":
	a31 = 0
if a31 == "ні":
	a31 = 1

print("32. Вам подобаєтеся дещо прикрашати свої досягнення?")
a32 = int(input(""))

if a32 == "так":
	a32 = 0
if a32 == "ні":
	a32 = 1

print("33. Ви в більшості випадків мовчите, коли знаходитеся в товаристві незнайомих людей?")
a33 = int(input(""))

if a33 == "так":
	a33 = 0
if a33 == "ні":
	a33 = 1

print("34. Ви іноді хвилюєтесь так, що не можете всидіти на місці?")
a34 = int(input(""))

if a34 == "так":
	a34 = 0
if a34 == "ні":
	a34 = 1

print("35. Ви швидко приймаєте рішення?")
a35 = int(input(""))

if a35 == "так":
	a35 = 1
if a35 == "ні":
	a35 = 0

print("36. Ви завжди розмовляєте голосно?")
a36 = int(input(""))

if a36 == "так":
	a36 = 1
if a36 == "ні":
	a36 = 0

print("37. Ви часто бачите страшні сни?")
a37 = int(input(""))

if a37 == "так":
	a37 = 0
if a37 == "ні":
	a37 = 1

print("38. Ви можете дати волю почуттям, відпочити і повеселитися в товаристві?")
a38 = int(input(""))

if a38 == "так":
	a38 = 1
if a38 == "ні":
	a38 = 0

print("39. Вас легко вразити?")
a39 = int(input(""))

if a39 == "так":
	a39 = 0
if a39 == "ні":
	a39 = 1

print("40. Вам траплялось говорити про когось погано?")
a40 = int(input(""))

if a40 == "так":
	a40 = 0
if a40 == "ні":
	a40 = 1

print("41.  Це правда, що ви здебільшого говорите й дієте швидко, не затримуючись довго над обдумуванням?")
a41 = int(input(""))

if a41 == "так":
	a41 = 1
if a41 == "ні":
	a41 = 0

print("42. Якщо Ви потрапили в незручне становище, Ви легко це переносите?")
a42 = int(input(""))

if a42 == "так":
	a42 = 0
if a42 == "ні":
	a42 = 1

print("43. Вам подобаються веселі ігри?")
a43 = int(input(""))

if a43 == "так":
	a43 = 1
if a43 == "ні":
	a43 = 0

print("44. Ви завжди їсте те, що Вам подають?")
a44 = int(input(""))

if a44 == "так":
	a44 = 1
if a44 == "ні":
	a44 = 0

print("45. Вам важко відповісти „ні”, коли у Вас щось прохають?")
a45 = int(input(""))

if a45 == "так":
	a45 = 0
if a45 == "ні":
	a45 = 1

print("46. Вам подобається ходити в гості?")
a46 = int(input(""))

if a46 == "так":
	a46 = 1
if a46 == "ні":
	a46 = 0

print("47. У Вас бувають такі хвилини, коли Вам не хочеться жити?")
a47 = int(input(""))

if a47 == "так":
	a47 = 0
if a47 == "ні":
	a47 = 1

print("48. Про Вас можна сказати, що Ви грубіян?")
a48 = int(input(""))

if a48 == "так":
	a48 = 0
if a48 == "ні":
	a48 = 1

print("49. Товариші вважають, що Ви весела й жвава людина?")
a49= int(input(""))

if a49 == "так":
	a49 = 1
if a49 == "ні":
	a49 = 0

print("50. Вам важко зосередитись на чомусь одному?")
a50 = int(input(""))

if a50 == "так":
	a50 = 0
if a50 == "ні":
	a50 = 1

print("51. Ви здебільшого сидите і дивитесь, ніж приймаєте участь у чомусь?")
a51 = int(input(""))

if a51 == "так":
	a51 = 0
if a51 == "ні":
	a51 = 1

print("52. Вам буває тяжко через різні думки?")
a52 = int(input(""))

if a52 == "так":
	a52 = 0
if a52 == "ні":
	a52 = 1

print("53. Ви завжди впевнені  втому, що зможете виконати те завдання, яке стоїть перед Вами?")
a53 = int(input(""))

if a53 == "так":
	a53 = 1
if a53 == "ні":
	a53 = 0

print("54. У Вас трапляються випадки, коли Ви почуваєте себе не самостійним?")
a54 = int(input(""))

if a54 == "так":
	a54 = 0
if a54 == "ні":
	a54 = 1

print("55. Вам тяжко заговорити першими з незнайомою людиною?")
a55 = int(input(""))

if a55 == "так":
	a55 = 0
if a55 == "ні":
	a55 = 1

print("56. У Вас бувають випадки, коли Ви думаєте, що те, що зробили, можна було б зробити по іншому?")
a56 = int(input(""))

if a56 == "так":
	a56 = 0
if a56 == "ні":
	a56 = 1

print("57. Коли на Вас хтось підвищує голос, Ваша реакція така ж?")
a57 = int(input(""))

if a57 == "так":
	a57 = 1
if a57 == "ні":
	a57 = 0

print("58. Трапляється так, що Ви почуваєте себе веселим або невеселим без будь-якої причини?")
a58 = int(input(""))

if a58 == "так":
	a58 = 0
if a58 == "ні":
	a58 = 1

print("59. Ви вважаєте, що рідко можна отримати задоволення від веселого товариства?")
a59 = int(input(""))

if a59 == "так":
	a59 = 0
if a59 == "ні":
	a59 = 1

print("60. Ви часто хвилюєтесь через те, що зробили щось не обміркувавши?")
a60 = int(input(""))

if a60 == "так":
	a60 = 0
if a60 == "ні":
	a60 = 1

E = int (a1 + a3 + a9 + a11 + a14 + a17 + a19 + a22 + a25 + a27 + a30 + a35 + a38 + a41 + a43 + a46 + a49 + a53 + a57 + a6 + a33 + a51 + a55 + a59)

N = int (a2 + a5 + a7 + a10 + a13 + a15 + a18 + a21 + a23 + a26 + a29 + a31 + a34 + a37 + a39 + a42 + a45 + a47 + a50 + a52 + a54 + a56 + a58 + a60)

T = int (a8 + a16 + a24 + a28 + a36 + a44 + a4 + a12 + a20 + a32 + a40 + a48)

if E > 12 and N > 14:
	print("Ви -- холерик. Дії холерика поривчасті. Він відрізняється підвищеною збудженістю та великою емоційністю.\n Прояв цього типу темпераменту в значній мірі залежить від спрямованості особистості.\n У людей із громадськими інтересами він фокусується в ініціативності, енергійност")

if E > 12 and N < 14:
	print("Ви -- сангвінік. Сангвінік швидко пристосовується до нових умов, швидко знаходить спільну розмову з людьми, комунікативний.\n Почуття швидко виникають і зникають. У людини цього типу яскрава міміка.\n Відсутність чіткої мети, не включеність сангвініка у творчу діяльність поступово формується в поверховість і нестабільність.")

if E < 12 and N > 14:
	print("Ви -- меланхолік. Реакція меланхоліка здебільшого відповідає силі подразника. Особливо потужне в людини цього типу темпераменту зовнішнє гальмування.\n Йому тяжко на чомусь зосередитись. Сильні подразники здебільшого викликають довготривалу реакцію гальмування.\n У стійких та стабільних умовах життя меланхолік характеризується змістовністю й глибиною думок.\n У негативних зовнішніх умовах меланхолік може стати замкнутим, боягузливим, неспокійним.")

if E < 12 and N <14:
	print("Ви -- флегматик. У флегматика нові форми поведінки виробляються повільно, але вони стійкі. Здебільшого флегматик спокійний, рівномірний, рідко виходить із себе, не схильних до афектів.\n Залежно від умов середовища життєдіяльності в нього можуть сформуватися позитивні риси (витримка, глибина думки і т. ін.)\n або ж яскраві негативні риси характеру (в’ялість, лінь, нестійкість, низькі вольові якості).")